"""Модуль форматтер.

Этот модуль определяет кастомные форматтеры для вывода справочной информации командной строки с использованием библиотеки Click.
Реализованные классы позволяют переопределить стандартное поведение форматирования справки, позволяя создать более подробное
представление команд, аргументов, опций и их описаний.
"""
from .fomatter import CommonGroupFormatter


class MLSHelp(CommonGroupFormatter):
    """Класс Формат Помощи MLS."""
    HEADING = 'Интерфейс командной строки MLS:'
